_Rarzrabotki/Rarus/USO2/Reports/уатВедомостьТЭП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>уатВедомостьТЭП</Name>
			<Comment>(уат)</Comment>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/уатВедомостьТЭП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает количество дней в работе указанного ТС
//
// Параметры:
//  ТС		 - Справочник.уатТС - транспортное средство
//  ДатаНач	 - Дата - начало периода
//  ДатаКон	 - Дата - конец периода
// 
// Возвращаемое значение:
//  Количество дней в работе - Число 
//
Функция АвтоДнейВРаботе(ТС, Организация, Колонна, ДатаНач, ДатаКон) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",          ТС);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНач",     ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",     ДатаКон);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатПутевойЛист.Ссылка,
	|	уатПутевойЛист.ДатаВыезда,
	|	уатПутевойЛист.ДатаВозвращения
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	уатПутевойЛист.Проведен
	|	И уатПутевойЛист.Организация = &Организация
	|	И уатПутевойЛист.ДатаВозвращения >= &ДатаНач
	|	И (&ДатаКон = ДАТАВРЕМЯ(1,1,1) ИЛИ уатПутевойЛист.ДатаВыезда <= КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ))
	|	И уатПутевойЛист.ТранспортноеСредство = &ТС";
	ВыборкаПЛ = Запрос.Выполнить().Выбрать();
	
	//дополнительный запрос для получения колонны ТС на момент ПЛ
	//можно было бы обойтись без запроса, если бы в ПЛ был реквизит Колонна
	ЗапросКолонна = Новый Запрос(
	"ВЫБРАТЬ
	|	уатМестонахождениеТС.Колонна КАК Колонна,
	|	уатМестонахождениеТС.Период КАК Период
	|ИЗ
	|	РегистрСведений.уатМестонахождениеТС КАК уатМестонахождениеТС
	|ГДЕ
	|	уатМестонахождениеТС.ТС = &ТС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	ЗапросКолонна.УстановитьПараметр("ТС", ТС);
	тблМестонахождение = ЗапросКолонна.Выполнить().Выгрузить();
	
	мсвДат = Новый Массив();
	Пока ВыборкаПЛ.Следующий() Цикл
		//определяем соответствует ли колонна ТС на момент ПЛ колонне из отчета
		КолоннаТС = Неопределено;
		Для Каждого ТекСтрокаКолонна Из тблМестонахождение Цикл
			Если ТекСтрокаКолонна.Период > ВыборкаПЛ.ДатаВозвращения Тогда
				Прервать;
			КонецЕсли;
			КолоннаТС = ТекСтрокаКолонна.Колонна;
		КонецЦикла;
		Если КолоннаТС <> Колонна Тогда
			Продолжить;
		КонецЕсли;
				
		ДатаНач_ = Макс(ДатаНач, ВыборкаПЛ.ДатаВыезда);
		ДатаКон_ = ?(ДатаКон = '00010101', ВыборкаПЛ.ДатаВозвращения, Мин(КонецДня(ДатаКон), ВыборкаПЛ.ДатаВозвращения));
		
		ТекДата_ = НачалоДня(ДатаНач_);
		Пока ТекДата_ <= НачалоДня(ДатаКон_) Цикл
			Если мсвДат.Найти(ТекДата_) = Неопределено Тогда
				мсвДат.Добавить(ТекДата_);
			КонецЕсли;
			
			ТекДата_ = ТекДата_ + 3600*24;
		КонецЦикла;
	КонецЦикла;
	АвтоДни_ = мсвДат.Количество();
	
	Возврат АвтоДни_;
	
КонецФункции

// Возвращает количество дней в хозяйстве указанного ТС,
// т.е. количество дней по данным местонахождения ТС в указанной организации и колонне за указанный период
// 
Функция АвтоДнейВХозяйстве(ТС, Организация, Колонна, Знач ДатаНач, Знач ДатаКон) Экспорт
	Рез = 0;
	
	ДатаНач = НачалоДня(ДатаНач);
	ДатаКон = НачалоДня(ДатаКон);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(уатМестонахождениеТС.Период, ДЕНЬ) КАК Начало,
	|	уатМестонахождениеТС.Организация КАК Организация,
	|	уатМестонахождениеТС.Колонна КАК Колонна
	|ИЗ
	|	РегистрСведений.уатМестонахождениеТС КАК уатМестонахождениеТС
	|ГДЕ
	|	уатМестонахождениеТС.ТС = &ТС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");
	Запрос.УстановитьПараметр("ТС", ТС);
	тблМестонахождение = Запрос.Выполнить().Выгрузить();
	
	Для Сч = 0 По тблМестонахождение.Количество()-1 Цикл
		ТекСтрока = тблМестонахождение[Сч];
		Если Сч = тблМестонахождение.Количество()-1 Тогда
			ТекСтрока_Конец = ДатаКон;
		Иначе
			ТекСтрока_Конец = НачалоДня(тблМестонахождение[Сч + 1].Начало-1);
		КонецЕсли;
		
		Если ТекСтрока.Организация = Организация И ТекСтрока.Колонна = Колонна
			И ТекСтрока.Начало <= ДатаКон И ТекСтрока_Конец >= ДатаНач Тогда
			Рез = Рез + (Мин(ТекСтрока_Конец, ДатаКон) - Макс(ТекСтрока.Начало, ДатаНач))/3600/24 + 1;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Рез;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки – Коллекция – Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета – СтрокаДереваЗначений – Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Ведомость ТЭП");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет позволяет получить информацию о технико-эксплуатационных показателях.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
